tests/mutants/event-field-obsolete.patch
diff --git a/services/sts/src/issue.rs b/services/sts/src/issue.rs
--- a/services/sts/src/issue.rs
+++ b/services/sts/src/issue.rs
@@ -378,7 +378,7 @@ where
             context: input.context.clone(),
             credential_id,
             reference_verifier: Some(reference_verifier),
-            epochs: request.epochs,
+            epochs: None,
             issued_at: request.at.clone(),
             descriptor,
             target: input.target,
